In [15]:
import pandas as pd
df = pd.read_csv("employees.csv")
df

            Name Department      Manager  Salary
0     Robin Hood        NaN          NaN     200
1  Arsene Wenger        Bar   Friar Tuck      50
2     Friar Tuck        Foo   Robin Hood     100
3    Little John        Foo   Robin Hood     100
4  Sam Allardyce        NaN          NaN     250
5  Dimi Berbatov        Foo  Little John      50

In [13]:
df['Salary'].max()

250

In [16]:
df[df.Salary > 50 ]

            Name Department     Manager  Salary
0     Robin Hood        NaN         NaN     200
2     Friar Tuck        Foo  Robin Hood     100
3    Little John        Foo  Robin Hood     100
4  Sam Allardyce        NaN         NaN     250